# https://github.com/Homebrew/homebrew-bundle

# specify a directory to install
cask_args appdir: '/Applications'

# install packages
tap 'caskroom/homebrew-cask' || true
tap 'caskroom/versions' || true

# install packages
brew 'git'
brew 'tree'
brew 'python'
brew 'python3'
brew 'vim'
brew 'nvim'
brew 'tmux'

# casks
cask 'google-chrome'
cask 'dropbox'
cask 'alfred'
cask 'evernote'
cask 'skype'
cask 'spotify'
cask '1password'
cask 'dash'
cask 'alacritty'
cask 'istat-menus'


